# -*- encoding: utf-8 -*-
import random
abbrev = {"К":["Комитет","Комбинат","Контроль"],"Г":["Государственной"], "Б":["Безопасности","Бытового"],
          "Р":["Российская"],"Ф":["Федерация","Федеральная","Федеративная"], "А":["Автоматизированная","Автоматическая"],
          "С":["Система","Служба"], "У":["Управления"], "О":["Обслуживания"]}
d=input("Введите аббревиатуру: ").upper()
s=' '
for letter in d:
    if abbrev.get(letter):
        s=s+(random.choice
             (abbrev.get(letter)))+" "
    else:
        print ("Нет такой аббревиатуры.", letter)
        break
print (s)


    



